In [3]:
import pandas as pd
pd.__version__

u'0.22.0'

In [4]:
pd.Series(['San Francisco', 'San Jose', 'Sacramento'])

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

In [6]:
california_housing_dataframe = pd.read_csv("https://storage.googleapis.com/mledu-datasets/california_housing_train.csv", sep=",")

california_housing_dataframe.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [8]:
city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'])
population = pd.Series([852469, 1015785, 485199, 12304])
pd.DataFrame({'City name' : city_names, 'Population' : population})

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199
3            NaN       12304

In [9]:
california_housing_dataframe.hist('housing_median_age')

array([[<matplotlib.axes.AxesSubplot object at 0x109445750>]],
      dtype=object)

In [11]:
cities = pd.DataFrame({'City name' : city_names, 'Population' : population})
print type(cities['City name'])
cities['City name']

<class 'pandas.core.series.Series'>

0    San Francisco
1         San Jose
2       Sacramento
3              NaN
Name: City name, dtype: object

In [12]:
cities

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199
3            NaN       12304

In [13]:
print cities['City name']

0    San Francisco
1         San Jose
2       Sacramento
3              NaN
Name: City name, dtype: object

In [15]:
cities['Area square miles'] = pd.Series([46.87, 176.53, 97.92])
cities['Population density'] = cities['Population'] / cities['Area square miles']
cities

       City name  Population  Area square miles  Population density
0  San Francisco      852469              46.87        18187.945381
1       San Jose     1015785             176.53         5754.177760
2     Sacramento      485199              97.92         4955.055147
3            NaN       12304                NaN                 NaN

In [16]:
import numpy as np
np.log(population)

0    13.655892
1    13.831172
2    13.092314
3     9.417680
dtype: float64

In [17]:
cities.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
cities.reindex([2, 0, 1])

       City name  Population  Area square miles  Population density
2     Sacramento      485199              97.92         4955.055147
0  San Francisco      852469              46.87        18187.945381
1       San Jose     1015785             176.53         5754.177760

In [19]:
np.random.permutation(cities.index)

array([1, 3, 2, 0])

In [20]:
cities.reindex(np.random.permutation(cities.index))

       City name  Population  Area square miles  Population density
1       San Jose     1015785             176.53         5754.177760
2     Sacramento      485199              97.92         4955.055147
3            NaN       12304                NaN                 NaN
0  San Francisco      852469              46.87        18187.945381

In [21]:
cities.reindex([0, 4, 5])

       City name  Population  Area square miles  Population density
0  San Francisco    852469.0              46.87        18187.945381
4            NaN         NaN                NaN                 NaN
5            NaN         NaN                NaN                 NaN